tutorials/addBasicPatches/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

vertices
(
    (0 0 0)
    (0.6 0 0)
    (0.6 0.21 0)
    (0 0.21 0)
    (0 0 0.6)
    (0.6 0 0.6)
    (0.6 0.21 0.6)
    (0 0.21 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 21 60) simpleGrading (1 1 1)
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    front
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
        left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
        right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
        back
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
