tutorials/addBasicPatches/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    // floor
    // {
    // type fixedValue;
    // value uniform 440;
    // }
    floor
    {
    type zeroGradient;
    }
    ceiling
    {
    type zeroGradient;
    }
    front
    {
    type zeroGradient;
    }
    left
    {
    type zeroGradient;
    }
    back
    {
    type zeroGradient;  
    }
    right
    {
    type zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 310;
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
