tutorials/addBasicPatches/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ceiling
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    
    front
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    left
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    right
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    // inlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            calculated;
    //     value           $internalField;
    // }
    inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
